tutorials/cfdemSolverRhoPimpleChem/test_case/CFD/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry       off; //on;

chemistryType
{
    chemistrySolver   ode;
    chemistryThermo   rho;
}

initialChemicalTimeStep 1e-07;

EulerImplicitCoeffs
{
    cTauChem        0.05;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          seulex;
    eps             0.05;
}


// ************************************************************************* //
