tutorials/cfdemSolverRhoPimpleChem/test_case/CFD/constant/foam.inp
species
(
        CO
        CO2
	N2
);

reactions
{
}


